import {
 BookOpenIcon,
 CalendarClockIcon,
 CalendarDaysIcon,
 CircleHelpIcon,
 ClipboardListIcon,
 Clock5Icon,
 GraduationCapIcon,
 LaptopIcon,
 MapPinIcon,
 SmartphoneIcon,
 UsersIcon,
} from "lucide-react";
import { ReactNode } from "react";

type FAQProps = {
 question: string;
 answer: string;
};

export enum CourseTabsName {
 "INTRODUCTION" = "INTRODUCTION",
 "FAQ" = "FAQ",
 "TEACHERS" = "TEACHERS",
 "CHAPTERS" = "CHAPTERS",
}

export type CourseTabProps =
 | {
    id: number;
    name: string;
    title: string;
    icon?: ReactNode;
    type: CourseTabsName.INTRODUCTION;
    body: string;
    logos: string[];
   }
 | {
    id: number;
    name: string;
    title: string;
    icon?: ReactNode;
    type: CourseTabsName.FAQ;
    items: FAQProps[];
   }
 | {
    id: number;
    name: string;
    title: string;
    icon?: ReactNode;
    type: CourseTabsName.CHAPTERS;
    chapters: {
     name: string;
     titles: string[];
    }[];
   }
 | {
    id: number;
    name: string;
    title: string;
    icon?: ReactNode;
    type: CourseTabsName.TEACHERS;
    teacher: {
     name: string;
     graduated: string;
     cv: string[];
    };
   };
export type CourseDetailNames =
 | "startingDate"
 | "courseDuration"
 | "daysOfHolding"
 | "courseCapacity"
 | "degreeAwarded"
 | "location";

export type CourseProps = {
 id: string;
 name: string;
 icon: ReactNode;
 tabs: CourseTabProps[];
 price: number;
 discount: number;
 details: { name: CourseDetailNames; value: any }[];
};

export const COURSES: CourseProps[] = [
 {
  id: "ae8fb969-f368-4fde-a838-f8936f06b9dd",
  name: "تعمیرات موبایل",
  icon: <SmartphoneIcon />,
  details: [
   { name: "startingDate", value: "2024/6/29" },
   { name: "courseDuration", value: 30 },
   { name: "daysOfHolding", value: "دوشنبه تا چهار شنبه" },
   { name: "courseCapacity", value: 120 },
   {
    name: "degreeAwarded",
    value: ["مدرک فنی حرفه ای", "مدرک آموزشگاه سی تلکام", "مدرک ICB ایتالیا"],
   },
   {
    name: "location",
    value: "خیابان مطهری نرسیده به سهروردی پلاک ۱۰۲",
   },
  ],
  tabs: [
   {
    id: 1,
    name: "معرفی",
    title: "آموزش تعمیرات موبایل",
    icon: <BookOpenIcon className="size-[inherit]" />,
    type: CourseTabsName.INTRODUCTION,
    body:
     "دوره تعمیرات موبایل آموزشگاه سی تلکام (سی تلکام آکادمی) یک دوره‌ تربیت متخصص تعمیرات حرفه‌ای در حوزه موبایل است.\n این دوره برای افرادی طراحی شده که علاقه‌مند به یادگیری مهارت‌های تعمیر و نگهداری انواع گوشی‌های موبایل هستند.\n در این دوره، مهارت آموزان اصول و مبانی تعمیرات موبایل، ابزارهای مورد نیاز، تشخیص و رفع عیوب سخت‌افزاری و نرم‌افزاری گوشی‌های موبایل را بصورت کامل و کاربردی آموزش می بینند. دوره تعمیرات موبایل فرصتی مناسب برای کسانی است که می‌خواهند با کسب مهارت‌های تخصصی، به بازار کار وارد شده و به عنوان یک تکنسین ماهر و حرفه‌ای در این حوزه فعالیت نمایند.  ",
    logos: [
     "/assets/images/icb-quality-logo.png",
     "/assets/images/irantvto-logo.png",
    ],
   },
   {
    id: 2,
    name: "سرفصل ها",
    title: "سرفصل ها",
    icon: <ClipboardListIcon className="size-[inherit]" />,
    type: CourseTabsName.CHAPTERS,
    chapters: [
     {
      name: "سطح یک",
      titles: [
       "الکترونیک عمومی",
       "شناخت برندها و خصوصیات و عملکرد سخت افزازی و نرم افزاری",
       "شناخت انواع سیستم های عامل",
       "شناخت رابط های کاربری مختلف",
       "شناخت انواع قطعات الکترونیک",
       "نحوه تست و عیب یابی قطعات مکانیکی و الکترونیکی تشکیل دهنده برد دستگاه",
       "آشنایی با انواع شماتیک و بلوک دیاگرام",
       "آشنایی با مدارات تشکیل دهنده بخش های مختلف تلفن همراه",
       "آشنایی با عیب یابی تلفن همراه از طریق نقشه خوانی و شماتیک",
       "شناخت قطعات از روی نقشه و نحوه یافتن قطعات مشابه و جایگزین",
       "توانایی تشخیص مدل و عیب ظاهری محصول",
       "شناخت انواع روش های باز و بست تلفن همراه",
       "تست و عیب یابی نرم افزاری و سخت افزاری انواع گوشی و نحوه تست قطعات تعویض شده",
       "شناخت شماره فنی قطعات تشکیل دهنده تلفن همراه",
       "آشنایی با انواع کدها و دستورات نرم افزاری تلفن همراه",
       "آشنایی با انواع باطری و نحوه تست و احیای دوباره آن ها",
       "شناخت انواع صفحه نمایش و اصول تعویض با فریم و بدون فریم آن ها",
       "توانایی تعویض انواع قطعات مکانیکی تشکیل دهنده تلفن همراه",
      ],
     },
     {
      name: "سطح دو",
      titles: [
       "آشنایی با کالک و پروتکل های ارتباطی در تلفن همراه",
       "شناخت تخصصی مدار آنتن و بلوک های RF , PF ومسیر های RX , T",
       "شناخت اصولی جریان کشی و تزریق ولتاژ",
       "شناخت بلوک تغذیه PMU و تحلیل آن",
       "شناخت مدار شارژ معمولی و سریع و پایه های باطری و تحلیل آن ها",
       "شناخت بلوک MCU و نحوه کار و تحلیل آن",
       "شناخت مدار صفحه نمایش و صفحه لمسی",
       "شناخت مدار بک الیت",
       "شناخت مدار دوربین",
       "شناخت مدار صفحه کلید",
       "شناخت مدار سیم کارت و کارت حافظه",
       "شناخت مدار صوت و تحلیل آن",
       "شناخت مدار وای فای بلوتوث",
       "شناخت انواع سنسورها و مدارات آن",
       "شناخت انواع ای سی ها و نحوه کار و عیب یابی آن ها",
       "نحوه کار با مولتی متر در اتصالات ، ولتاژ گیری ، اهم گیری و اهم چک قطعات",
       "نحوه کار با منبع تغذیه",
       "شناخت انواع قطعات الکترونیکی و نحوه تست و بکار گیری آن ها در مدار و انواع آن ها",
       "توانایی تعمیر پایه های معیوب آی سی و برد و استفاده مجدد از آن ها",
       "توانایی کار با شابلون های مختلف و همه کاره",
       "توانایی تعویض و نصب و جایگذاری انواع قطعات مکانیکی و الکترونیکی غیر چسبی روی برد",
       "توانایی سیم کشی مسیر های برد و جامپرها",
       "توانایی پاک سازی اصولی برد و استفاده از تجهیزات مرتبط برای جایگذاری قطعات روی برد",
       "شناخت انواع چیپ های تلفن همراه و نحوه فلش و تغییر سیستم عامل آن ها",
       "شناخت انواع نرم افزار های بارگذاری سیستم عامل",
       "شناخت انواع محیط های نرم افزاری تلفن همراه و تست پوینت ها",
       "تهیه و تشخیص رام مخصوص هر دستگاه با توجه به مدل و نسخه و منطقه و مدل نامبر آن",
       "شناخت انواع روش های حذف اکانت ها مانند FRP از روی تلفن همراه",
      ],
     },
     {
      name: "سطح سه",
      titles: [
       "شناخت و توانایی کار اصولی با باکس ها و اکانت های نرم افزازی مختلف",
       "نقشه خانی پیشرفته و کار با نرم افزار های ZXW , JC , DZKJ و ...",
       "تست و شناسایی انواع سی پی یو گوشی های خاموش و نحوه جریان کشی آن ها و قلق های تعمیراتی آن",
       "برداشتن آی سی های چسبی ، پایه سازی ، تمیز کردن و شابلون زدن",
       "ریبال انواع هارد و سی پی یو یک طبقه ، دو طبقه و حفره دار",
       "تعویض هارد و کار با پروگرمر های EASY JTAG , MEDUSA PRO و ...",
       "اصول ISP زدن و استخراج فایل بکاپ سریال (تعمیر بوت ، پروگرامر و تعمیر انواع هارد)",
       "عیب یابی معکوس و ایراد یابی المان ها",
       "جداسازی اصولی طبقات برد های دو طبقه و شابلون زدن و نصب مجدد آن ها",
       "شناخت مدارات فیس آیدی و تعمیرات ان",
       "رفع ارور های مربوط به تعویض قطعات مختلف مانند باطری ، دوربین ، صفحه نمایش و ...",
       "پنیک فول و تحلیل آن",
       "ترمیم شماره سریال و سایر ایرادات تخصصی نرم افزاری",
      ],
     },
    ],
   },
   {
    id: 3,
    name: "اساتید",
    title: "اساتید",
    icon: <UsersIcon className="size-[inherit]" />,
    type: CourseTabsName.TEACHERS,
    teacher: {
     name: "داریوش سلامی",
     graduated: "فارغ التحصیل دانشگاه شهید رجایی",
     cv: [
      "مدیر گارانتی و فنی شرکت های کامپیوتری",
      "20 سال سابقه تعمیرات لپ تاپ",
      "17 سال سابقه تدریس در آموزشگاه های تعمیرات لپ تاپ",
     ],
    },
   },
   {
    id: 4,
    name: "سوالات متداول",
    title: "سوالات متداول",
    icon: <CircleHelpIcon className="size-[inherit]" />,
    type: CourseTabsName.FAQ,
    items: [
     {
      question: "روزها و ساعات کاری در سی تلکام آکادمی به چه صورت است؟",
      answer: "همه روزه به جز روزهای تعطیل از ساعت 9 الی 17 میباشد",
     },
     {
      question:
       "در دوره های آموزشی تعمیرات موبایل چه گوش هایی آموزش داده می شوند؟",
      answer:
       "در دوره های آموزش تعمیرات موبایل از گوشی های دکمه ای تا اندروید و آی او اس به طور کامل آموزش داده می شود.",
     },
     {
      question: "آیا امکان ثبت نام برای تمامی شهر ها و استان ها وجود دارد؟",
      answer:
       "بله، امکان ثبت نام برای تمامی افراد ساکن در سایر شهرها و استان های کشور فراهم شده است.",
     },
     {
      question: "آیا اساتید دارای تجربه، دانش و سابقه حرفه ای می باشند؟",
      answer:
       "بله، تمامی استاد های سی تلکام آکادمی دارای تجارب و سوابق بالایی در حوزه تعمیرات و تدریس هستند و تمامی استاد ها مدارک متعدد بین المللی و داخلی را کسب کرده اند.",
     },
     {
      question:
       "آیا پس از اتمام دوره می توانم درآمد داشته و یا کسب و کار راه اندازی کنم؟",
      answer:
       "بله، شرکت سی تلکام از میان مهارت آموزان موفق سی تلکام آکادمی اقدام به جذب تعمیرکار مجرب میکند.\n" +
       "در عین حال مهارت آموزان پس از  پایان دوره ها و کسب مدرک از سی تلکام آکادمی میتوانند در مراکز معتبر تعمیرات گوشی و لپ تاپ مشغول به فعالیت شوند و یا کسب و کار خود را در این حوزه راه اندازی کنند\n",
     },
    ],
   },
  ],
  price: 10_000_000,
  discount: 1,
 },
 {
  id: "f9e3542d-26f9-4bbe-8c8f-48d731e5aaab",
  name: "تعمیرات لپ تاپ",
  icon: <LaptopIcon />,
  tabs: [
   {
    id: 1,
    name: "معرفی",
    title: "آموزش تعمیرات لپ تاپ",
    icon: <BookOpenIcon className="size-[inherit]" />,
    type: CourseTabsName.INTRODUCTION,
    body:
     "دوره تعمیرات لپ تاپ آموزشگاه سی تلکام (سی تلکام آکادمی) یک دوره‌ تربیت متخصص تعمیرات حرفه‌ای در حوزه لپ تاپ است.\n" +
     "این دوره برای افرادی طراحی شده که علاقه‌مند به یادگیری مهارت‌های تعمیر و نگهداری انواع مدل های لپ تاپ هستند.\n" +
     "در این دوره، مهارت آموزان اصول و مبانی تعمیرات لپ تاپ، ابزارهای مورد نیاز، تشخیص و رفع عیوب سخت‌افزاری و نرم‌افزاری  لپ تاپ ها را بصورت کامل و کاربردی آموزش می بینند.\n" +
     "دوره تعمیرات لپ تاپ  فرصتی مناسب برای کسانی است که می‌خواهند با کسب مهارت‌های تخصصی، به بازار کار وارد شده و به عنوان یک تکنسین ماهر و حرفه‌ای در این حوزه فعالیت نمایند.\n",
    logos: [
     "/assets/images/icb-quality-logo.png",
     "/assets/images/irantvto-logo.png",
    ],
   },
   {
    id: 2,
    name: "سرفصل ها",
    title: "سرفصل ها",
    icon: <ClipboardListIcon className="size-[inherit]" />,
    type: CourseTabsName.CHAPTERS,
    chapters: [
     {
      name: "فصل اول:مفاهیم اولیه الکترونیک",
      titles: [
       "نیروی‌الکتریسیته",
       "شدت جریان",
       "ولتاز",
       "سیگنال",
       "سیکل",
       "فرکانس",
       "پیک",
       "نیمه هادی",
       "عملکرد آداپتور",
       "عملکرد مولتی متر",
       "ولتاژگیری",
       "SMD",
       "PCB",
      ],
     },
     {
      name: "فصل دوم:شناخت قطعات الکترونیک",
      titles: [
       "فیوز",
       "سلف",
       "خازن",
       "مقاومت",
       "دیود",
       "ترانزیستور",
       "ای سی",
       "کریستال",
      ],
     },
     {
      name: "فصل سوم:کارگاه عملی",
      titles: [
       "باز و بست اصولی دستگاه",
       "سرویس‌اصولی سیستم کولینگ",
       "پی سی بی کات",
       "قطعه برداری با هویه",
       "قطعه برداری با هیتر",
       "BGA MACHINE",
       "پروگرم بایوس",
       "پروگرم io",
       "CLEAR ME REGION",
      ],
     },
     {
      name: "فصل چهارم:شناخت مدارات و عیب یابی",
      titles: [
       "شناخت اجزای مادربرد",
       "بلوک دیاگرام",
       "ولتاز نواحی مختلف",
       "مدار pwm",
       "مدار محافظ",
       "فاز رم",
       "فاز گرافیک",
       "مدار فرکانس",
       "مدار سی پیو فن",
       "مدار صدا",
       "مدار یو اس بی",
       "مدار ریست",
       "مدار سوییچ",
       "مدار شارژ",
       "مدارpch",
       "عیب یابی ای او",
       "ریست پسورد",
       "صفحه ابی",
       "KEYBOARD",
       "TOUCHPAD",
       "CARD READER",
       "WEBCAM",
       "WIFI",
       "مشکل اب خوردگی لپ تاپ",
       "عیب یابی مدار شارژ و تغذیه",
       "آموزش شماتیک",
       "آموزش برد ویو",
       "آموزش BENCHMARK",
       "NO BOOT",
       "NO POWER",
       "چند نکته تعمیری",
      ],
     },
    ],
   },
   {
    id: 3,
    name: "اساتید",
    title: "اساتید",
    icon: <UsersIcon className="size-[inherit]" />,
    type: CourseTabsName.TEACHERS,
    teacher: {
     name: "داریوش سلامی",
     graduated: "فارغ التحصیل دانشگاه شهید رجایی",
     cv: [
      "مدیر گارانتی و فنی شرکت های کامپیوتری",
      "20 سال سابقه تعمیرات لپ تاپ",
      "17 سال سابقه تدریس در آموزشگاه های تعمیرات لپ تاپ",
     ],
    },
   },
   {
    id: 4,
    name: "سوالات متداول",
    title: "سوالات متداول",
    icon: <CircleHelpIcon className="size-[inherit]" />,
    type: CourseTabsName.FAQ,
    items: [
     {
      question: "پیش نیاز مورد نیاز برای ثبت نام دوره تعمیرات لپ تاپ چیست؟",
      answer: "دوره تعمیرات لپ تاپ هیچ پیش نیازی ندارد.",
     },
     {
      question: "پس از پایان دوره چه مدرکی دریافت خواهد شد؟",
      answer:
       "پس از پایان دوره مدرک پیشتازان فناوری سیب طلایی و همچنین ICB  ایتالیا اعطا خواهد شد.",
     },
     {
      question: "بعد از اتمام دوره میتوان وارد بازار کار شد؟",
      answer:
       "بله، مهارت آموزان پس اتمام موفقیت آمیز دوره تعمیرات لپ تاپ به راحتی میتوانند در بازار کار فعال شده و کسب درآمد کنند.\n همچنین برخی از مهارت آموزان در شرکت سی تلکام جذب میگردند.",
     },
     {
      question: "تعمیر چه مدل از لپ تاپ های موجود در بازار آموزش داده می شود؟",
      answer: "تعمیرات تمامی برندهای موجود در بازار کشور تدریس میگردد.",
     },
     {
      question: "مخاطبان دوره تعمیرات لپ تاپ چه کسانی و با چه رنج سنی هستند؟",
      answer:
       "این دوره هیچ محدودیت سنی نداشته و تمامی اقشار جامعه (آقایان و بانوان) میتوانند شرکت کنند.",
     },
    ],
   },
  ],
  details: [
   { name: "startingDate", value: "2024/6/29" },
   { name: "courseDuration", value: 30 },
   { name: "daysOfHolding", value: "شنبه تا چهار شنبه" },
   { name: "courseCapacity", value: 120 },
   {
    name: "degreeAwarded",
    value: ["مدرک فنی حرفه ای", "مدرک آموزشگاه سی تلکام", "مدرک ICB ایتالیا"],
   },
   {
    name: "location",
    value: "خیابان مطهری نرسیده به سهروردی پلاک ۱۰۲",
   },
  ],
  price: 10_000_000,
  discount: 1,
 },
];

export const COURSE_DETAIL_ATTRIBUTES = new Map<
 CourseDetailNames,
 { icon: ReactNode; title: string; formatter?: (value: any) => ReactNode }
>([
 [
  "startingDate",
  {
   title: "تاریخ شروع",
   icon: <CalendarClockIcon className="size-[inherit]" />,
   formatter: (value) =>
    new Date(value).toLocaleDateString("fa-IR", {
     day: "2-digit",
     month: "long",
     year: "numeric",
    }),
  },
 ],
 [
  "courseDuration",
  {
   title: "مدت زمان دوره",
   icon: <Clock5Icon className="size-[inherit]" />,
   formatter: (value) => `${value} ساعت`,
  },
 ],
 [
  "location",
  {
   title: "محل برگزاری",
   icon: <MapPinIcon className="size-[inherit]" />,
  },
 ],
 [
  "degreeAwarded",
  {
   title: "مدرک اعطایی",
   icon: <GraduationCapIcon className="size-[inherit]" />,
   formatter: (value) => value.join("\n"),
  },
 ],
 [
  "daysOfHolding",
  {
   title: "روز های برگزاری",
   icon: <CalendarDaysIcon className="size-[inherit]" />,
  },
 ],
 [
  "courseCapacity",
  {
   title: "ظرفیت دوره",
   icon: <UsersIcon className="size-[inherit]" />,
   formatter: (value) => `${value} نفر منتخب`,
  },
 ],
]);
